doc/slides/slide_encapsulation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Encapsulation des données</title>
<!-- 2013-10-19 sam. 17:07 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" href="../stylesheets/styles.css">
                 <link rel="stylesheet" href="../stylesheets/org-pygments.css">
</head>
<body>
<div id="preamble" class="status">
</a><a href="slide_compilation.html">Compilation & Directives de préprocesseur </a><a href="slide_pointeur.html">Pointeurs, Références & Allocation Dynamique de Mémoire </a><a href="slide_specificite_c++.html">Spécificités du C++ (indépendantes de la POO) </a><a href="slide_struct_class.html">Structures & Classes </a><aa>Encapsulation des données </aa><aa>Constructeur & Destructeur de classe </aa><aa>Amitié & Surcharge d'opérateur </aa><aa>Héritage (Partie 1) </aa><aa>Héritage (Partie 2) </aa><aa>Patrons de fonctions et de classes </aa><aa>Introduction à la librairie standard </aa>
                     <hr/>
                     <a href="../../index.html">Retour menu principal</a>
</div>
<div id="content">
<h1 class="title">Encapsulation des données</h1><hr/>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Définition</h2>
<div class="outline-text-2" id="text-1">
<p>
L&rsquo;encapsulation consiste à interdire l&rsquo;accès de certains membres d&rsquo;une classe à
toutes fonctions extérieures à la classe
</p>

<ul class="org-ul">
<li>il n&rsquo;est plus possible d&rsquo;agir <b>directement</b> sur les données d&rsquo;un objet
</li>

<li>la modification des membres de l&rsquo;objet se fait par <b>l&rsquo;intermédiaire de
méthodes associées</b>
</li>
</ul>

<p>
<b>Syntaxe :</b> les mots clés sont <b><code>private</code></b> et <b><code>public</code></b>
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Exemple</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">class</span> <span class="org-type">particule</span>
{
<span class="org-keyword">private</span>:
  <span class="org-comment-delimiter">// </span><span class="org-comment">D&#233;claration de membres</span>
  <span class="org-type">double</span> <span class="org-variable-name">m_masse</span>;
  <span class="org-type">double</span> <span class="org-variable-name">m_charge</span>;
};
</pre>
</div>

<p>
<b>Conséquence :</b>
</p>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-type">particule</span> <span class="org-variable-name">electron</span>;
electron.m_masse = 0.511; <span class="org-comment-delimiter">// </span><span class="org-comment">erreur de compilation</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Exemple complet (1/2)</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">class</span> <span class="org-type">particule</span>
{
<span class="org-keyword">public</span>:
  <span class="org-comment-delimiter">// </span><span class="org-comment">D&#233;claration des getters et setters</span>
  <span class="org-type">double</span> <span class="org-function-name">get_masse</span>  () <span class="org-keyword">const</span>;
  <span class="org-type">double</span> <span class="org-function-name">get_charge</span> () <span class="org-keyword">const</span>;

  <span class="org-type">void</span> <span class="org-function-name">set_masse</span>  (<span class="org-keyword">const</span> <span class="org-type">double</span> <span class="org-variable-name">masse_</span>);
  <span class="org-type">void</span> <span class="org-function-name">set_charge</span> (<span class="org-keyword">const</span> <span class="org-type">double</span> <span class="org-variable-name">charge_</span>);

<span class="org-keyword">private</span>:
  <span class="org-comment-delimiter">// </span><span class="org-comment">D&#233;claration de membres</span>
  <span class="org-type">double</span> <span class="org-variable-name">m_masse</span>;
  <span class="org-type">double</span> <span class="org-variable-name">m_charge</span>;
};
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Exemple complet (2/2)</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-comment-delimiter">// </span><span class="org-comment">D&#233;finition des m&#233;thodes</span>
<span class="org-type">double</span> <span class="org-constant">particle</span>::<span class="org-function-name">get_masse</span> () <span class="org-keyword">const</span>
{
  <span class="org-keyword">return</span> m_masse;
}

<span class="org-type">void</span> <span class="org-constant">particle</span>::<span class="org-function-name">set_masse</span> (<span class="org-keyword">const</span> <span class="org-type">double</span> <span class="org-variable-name">masse_</span>)
{
  m_masse = masse_;
}
...
particle electron;
electron.set_masse (0.511);
<span class="org-keyword">const</span> <span class="org-type">double</span> <span class="org-variable-name">electron_masse</span> = electron.get_masse ();
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Intérêts de L&rsquo;encapsulation</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>Lors de la programmation et surtout de la réutilisation d&rsquo;un objet dans un
autre programme, l&rsquo;encapsulation empêche la modification non voulue des données
membres,
</li>

<li>L&rsquo;objet, vu de l&rsquo;extérieur, <b>n&rsquo;est caractérisé que par ses méthodes</b> :

<ol class="org-ol">
<li>l&rsquo;objet est plus facile à utiliser pour quelqu&rsquo;un d&rsquo;extérieur : il lui
suffit d&rsquo;utiliser les méthodes.
</li>
<li>la maintenance et l&rsquo;amélioration de l&rsquo;objet sont grandement
facilitées. Tant que la finalité des méthodes ne change pas, on peut
modifier les rouages sans perturber pour autant les utilisateurs de la
classe.
</li>
<li>l&rsquo;objet est facilement réutilisable.
</li>
</ol>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">Inconvénients de l&rsquo;encapsulation</h2>
<div class="outline-text-2" id="text-6">
<p>
De prime abord, peut paraître inutile et lourd à employer
</p>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">Quelques règles élémentaires</h2>
<div class="outline-text-2" id="text-7">
<p>
La création de chaque nouvelle classe <code>exemple_classe</code> se décompose en trois
étapes :
</p>

<ol class="org-ol">
<li>création d&rsquo;un fichier <code>exemple_classe.h</code> qui contient <b>la déclaration</b> de la
classe,
</li>

<li>création d&rsquo;un fichier <code>exemple_classe.cc</code> qui contient <b>les définitions</b> des
méthodes de la classe,
</li>

<li>création d&rsquo;un programme test <code>test_exemple_classe.cc</code> qui contient <b>le
programme principal</b> <i>i.e</i> le bloc d&rsquo;appel <code>main</code>.
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">Déclaration de la classe</h2>
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-sec-8-1" class="outline-3">
<h3 id="sec-8-1">Fichier <code>exemple_classe.h</code></h3>
<div class="outline-text-3" id="text-8-1">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-preprocessor">#if</span><span class="org-preprocessor"><span class="org-negation-char">n</span></span><span class="org-preprocessor">def</span> __exemple_classe_h__
<span class="org-preprocessor">#define</span> <span class="org-variable-name">__exemple_classe_h__</span> 1
<span class="org-keyword">class</span> <span class="org-type">exemple_classe</span>
{
<span class="org-keyword">public</span>:
  <span class="org-type">void</span>   <span class="org-function-name">set_dummy</span> (<span class="org-keyword">const</span> <span class="org-type">double</span> <span class="org-variable-name">dummy_</span>);
  <span class="org-type">double</span> <span class="org-function-name">get_dummy</span> () <span class="org-keyword">const</span>;
<span class="org-keyword">private</span>:
  <span class="org-type">double</span> <span class="org-variable-name">m_dummy</span>;
};
<span class="org-preprocessor">#endif</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9">Définition de la classe</h2>
<div class="outline-text-2" id="text-9">
</div><div id="outline-container-sec-9-1" class="outline-3">
<h3 id="sec-9-1">Fichier <code>exemple_classe.cc</code></h3>
<div class="outline-text-3" id="text-9-1">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-preprocessor">#include</span> <span class="org-string">"exemple_classe.h"</span>

<span class="org-type">void</span> <span class="org-constant">exemple_classe</span>::<span class="org-function-name">set_dummy</span> (<span class="org-keyword">const</span> <span class="org-type">double</span> <span class="org-variable-name">dummy_</span>)
{
  m_dummy = dummy_;
}

<span class="org-type">double</span> <span class="org-constant">exemple_class</span>::<span class="org-function-name">get_dummy</span> () <span class="org-keyword">const</span>
{
  <span class="org-keyword">return</span> m_dummy;
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10">Utilisation de la classe</h2>
<div class="outline-text-2" id="text-10">
</div><div id="outline-container-sec-10-1" class="outline-3">
<h3 id="sec-10-1">Fichier <code>text_exemple_classe.cc</code></h3>
<div class="outline-text-3" id="text-10-1">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-preprocessor">#include</span> <span class="org-string">"exemple_classe.h"</span>

<span class="org-type">int</span> <span class="org-function-name">main</span> ()
{
  <span class="org-type">exemple_classe</span> <span class="org-variable-name">my_exemple_classe</span>;
  my_exemple_classe.set_dummy (666);
  <span class="org-keyword">const</span> <span class="org-type">double</span> <span class="org-variable-name">my_dummy</span> = my_example_class.get_dummy ();
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-10-2" class="outline-3">
<h3 id="sec-10-2">Compilation</h3>
<div class="outline-text-3" id="text-10-2">
<div class="center">
<p>
<code>$ g++ exemple_class.cc test_exemple_classe.cc</code> \\ <code>-o test_exemple_classe.exe</code>
</p>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
